<template>
  <section class="slug my-5">
    <div id="title">
      このブログについて
    </div>
    <div id="body">
      <p class="my-3">
        運営者ろっぽんが、日々の生活で気づいたこと・勉強になったことなどを備忘録として残していくブログです。
        せっかくインターネット場でオープンにするので、公開する記事がどなたかのお役に立てるものかどうか
        常に意識したいと思います。最初は誰にも読まれないと思いますが、頑張って更新しようと思います。
      </p>
      <p class="my-3">
        記事の内容は主に、私の趣味の内容；プログラミング、ランニング、筋トレ、暗号通貨関連だったり、
        思いついたこと・発見したこと・考えたこと・困っていることなど、雑多なものです。
      </p>
      <div class="my-3">
        少し技術的なことも。<br />
        このブログは、アメーバブログ・ライブドアブログ・はてなブログなどのブログプラットフォーム上のものではありません。
        また、パソコンが少し得意な人がブログ運営するときに使うWordPressも使っておりません。
        このブログは、
        <div class="delete">
          Nuxt.js + Contentful + Netfly
        </div>
        <div>
          Nuxt.js + Contentful + Firebase <br />
          ※
          <i
            >パフォーマンス向上のため、ホスティング先をNetlifyからFirebaseに移行しました。(2020/8/30追記)
          </i>
          <br />
        </div>
        という組み合わせ(いわゆるJAMStackの一種)で構成されていて、ちょっと新しいやりかたで作られています。
        サイトのパフォーマンスやブログの保守運用性を考えたところ、この構成はわりかし優位性があるということで採用しました。
        「この実装はどうやったのか？」など質問があったらお気軽にお問い合わせください。<br />
        また、githubにソースコードをすべて公開しているので、よろしかったら参考にしてください。
        (綺麗なコードとは言えませんが。。汗)
      </div>
    </div>
  </section>
</template>
<style scoped>
.delete {
  text-decoration: line-through;
}
</style>
